Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 30, 30, 32)        896       
_________________________________________________________________
activation_1 (Activation)    (None, 30, 30, 32)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 15, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 13, 13, 32)        9248      
_________________________________________________________________
activation_2 (Activation)    (None, 13, 13, 32)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 64)          18496     
_________________________________________________________________
activation_3 (Activation)    (None, 4, 4, 64)          0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               32896     
_________________________________________________________________
activation_4 (Activation)    (None, 128)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 36)                4644      
_________________________________________________________________
activation_5 (Activation)    (None, 36)                0         
=================================================================
Total params: 66,180
Trainable params: 66,180
Non-trainable params: 0
_________________________________________________________________
{'val_loss': [2.827134132385254, 2.5268447399139404, 2.1305556297302246, 2.3273987770080566, 2.1386876106262207, 2.1121163368225098, 2.046109199523926, 1.9656431674957275, 1.966910719871521, 2.015751600265503, 1.8845417499542236, 1.8972114324569702, 1.8886492252349854, 1.9500576257705688, 1.8870093822479248, 1.9739781618118286, 1.9134798049926758, 1.8512680530548096, 1.8068736791610718, 1.869287133216858, 1.8268755674362183, 1.8113254308700562, 1.874053955078125, 1.813114047050476, 1.9085278511047363, 1.8538835048675537, 1.7738430500030518, 1.8443408012390137, 1.797869086265564, 1.8859777450561523, 1.7801239490509033, 1.7376199960708618, 1.7698439359664917, 1.7964680194854736, 1.728853464126587, 1.7718729972839355, 1.7679229974746704, 1.8289694786071777, 1.8652310371398926, 1.7799946069717407, 1.720257043838501, 1.7022185325622559, 1.669001579284668, 1.7186657190322876, 1.7385516166687012, 1.6379849910736084, 1.7339723110198975, 1.60979163646698, 1.6324524879455566, 1.636246681213379, 1.59385085105896, 1.6406004428863525, 1.7168619632720947, 1.5592873096466064, 1.5944440364837646, 1.5727803707122803, 1.5719082355499268, 1.5251615047454834, 1.489574909210205, 1.5119988918304443, 1.4138715267181396, 1.4140369892120361, 1.4446921348571777, 1.4239048957824707, 1.5927085876464844, 1.406447172164917, 1.337569236755371, 1.3001165390014648, 1.2285572290420532, 1.266316533088684, 1.2495009899139404, 1.3383519649505615, 1.2484180927276611, 1.3863575458526611, 1.173400640487671, 1.139931321144104, 1.1312203407287598, 1.072336196899414, 1.0180058479309082, 1.2618886232376099, 0.9644672870635986, 1.100191354751587, 0.9278990030288696, 0.9509947896003723, 0.9034807682037354, 0.8726449012756348, 1.0327093601226807, 1.060821533203125, 0.8701858520507812, 0.8287019729614258, 0.8986451625823975, 0.7369958758354187, 0.6987686157226562, 0.6931853294372559, 0.6538872718811035, 0.6832661628723145, 0.7602859139442444, 1.012827754020691, 0.7481824159622192, 0.6528355479240417, 0.6348831653594971, 0.6335400342941284, 0.5839421153068542, 0.5794274806976318, 0.5507999062538147, 0.5669196844100952, 0.5484579205513, 0.4940011203289032, 0.5104365944862366, 0.5414379239082336], 'acc': [0.0833333358168602, 0.0833333358168602, 0.0, 0.0, 0.0833333358168602, 0.25, 0.25, 0.0833333358168602, 0.25, 0.0, 0.25, 0.1666666716337204, 0.1666666716337204, 0.0833333358168602, 0.0833333358168602, 0.0833333358168602, 0.4166666567325592, 0.0, 0.3333333432674408, 0.0, 0.1666666716337204, 0.0833333358168602, 0.0, 0.25, 0.0833333358168602, 0.0833333358168602, 0.4166666567325592, 0.1666666716337204, 0.25, 0.0833333358168602, 0.0833333358168602, 0.4166666567325592, 0.3333333432674408, 0.0833333358168602, 0.4166666567325592, 0.1666666716337204, 0.3333333432674408, 0.25, 0.25, 0.0833333358168602, 0.0833333358168602, 0.25, 0.25, 0.1666666716337204, 0.1666666716337204, 0.4166666567325592, 0.1666666716337204, 0.5, 0.25, 0.25, 0.1666666716337204, 0.25, 0.25, 0.25, 0.3333333432674408, 0.3333333432674408, 0.3333333432674408, 0.1666666716337204, 0.0833333358168602, 0.0, 0.5833333134651184, 0.3333333432674408, 0.5, 0.3333333432674408, 0.4166666567325592, 0.1666666716337204, 0.25, 0.3333333432674408, 0.5833333134651184, 0.3333333432674408, 0.3333333432674408, 0.5, 0.4166666567325592, 0.4166666567325592, 0.25, 0.5833333134651184, 0.5833333134651184, 0.3333333432674408, 0.6666666865348816, 0.5, 0.4166666567325592, 0.6666666865348816, 0.4166666567325592, 0.5833333134651184, 0.4166666567325592, 0.6666666865348816, 0.6666666865348816, 0.5833333134651184, 0.4166666567325592, 0.5, 0.5833333134651184, 0.5833333134651184, 0.75, 0.9166666865348816, 0.6666666865348816, 0.8333333134651184, 0.6666666865348816, 0.6666666865348816, 0.5833333134651184, 0.5833333134651184, 0.6666666865348816, 0.5833333134651184, 0.5833333134651184, 0.6666666865348816, 0.75, 0.75, 0.75, 1.0, 0.75, 0.9166666865348816], 'loss': [3.446298599243164, 3.2206833362579346, 2.6872968673706055, 2.75642466545105, 2.710826873779297, 2.460911273956299, 2.1261651515960693, 2.4669806957244873, 2.4963762760162354, 2.4652340412139893, 2.217181444168091, 2.155794858932495, 2.072833299636841, 2.503826856613159, 2.1939783096313477, 2.2007148265838623, 2.1748600006103516, 2.030405044555664, 2.095576524734497, 2.240828514099121, 1.9789228439331055, 1.8285226821899414, 2.4326486587524414, 2.1620171070098877, 2.4535555839538574, 2.291675567626953, 1.7607778310775757, 1.9473870992660522, 1.9335960149765015, 2.3861136436462402, 2.190007448196411, 1.762877106666565, 2.0677974224090576, 2.0957140922546387, 2.0019047260284424, 2.0797171592712402, 1.8006525039672852, 2.2127959728240967, 2.056318521499634, 2.147181749343872, 1.941005825996399, 1.8900007009506226, 1.979901671409607, 2.1007039546966553, 2.1123745441436768, 1.7613385915756226, 2.2075154781341553, 1.7839775085449219, 1.5638383626937866, 1.9485682249069214, 1.8442316055297852, 2.0621259212493896, 1.8235784769058228, 1.712253451347351, 1.4641261100769043, 1.7073825597763062, 1.7486521005630493, 1.9107775688171387, 1.9303579330444336, 1.8074172735214233, 1.5020455121994019, 1.6646264791488647, 1.5901232957839966, 1.7910741567611694, 1.5286884307861328, 1.8299144506454468, 1.7250099182128906, 1.482752799987793, 1.3806041479110718, 1.8132033348083496, 1.5704187154769897, 1.5832171440124512, 1.5446513891220093, 1.7084583044052124, 1.594639778137207, 1.2856122255325317, 1.4919967651367188, 1.6590518951416016, 1.1430541276931763, 1.2450536489486694, 1.2634975910186768, 0.9499556422233582, 1.3404254913330078, 1.3630622625350952, 1.4119868278503418, 1.0738905668258667, 0.8856081962585449, 1.152328610420227, 1.3059364557266235, 0.9900290369987488, 1.1167265176773071, 0.9309094548225403, 0.8942103385925293, 0.7151408195495605, 0.7841350436210632, 0.5787685513496399, 0.8321154117584229, 0.7805048823356628, 1.0387698411941528, 1.1077481508255005, 0.7800703048706055, 0.9483403563499451, 0.9700128436088562, 0.8845968246459961, 0.5691508650779724, 0.6907117962837219, 0.9191322922706604, 0.5805370807647705, 0.54708331823349, 0.45401397347450256], 'val_acc': [0.1875, 0.1875, 0.1875, 0.1875, 0.1875, 0.125, 0.1875, 0.1875, 0.1875, 0.125, 0.1875, 0.25, 0.1875, 0.1875, 0.1875, 0.1875, 0.125, 0.1875, 0.25, 0.1875, 0.1875, 0.25, 0.1875, 0.25, 0.375, 0.3125, 0.3125, 0.1875, 0.3125, 0.3125, 0.4375, 0.4375, 0.375, 0.3125, 0.5625, 0.25, 0.4375, 0.25, 0.1875, 0.1875, 0.5625, 0.375, 0.5625, 0.375, 0.4375, 0.5, 0.4375, 0.5, 0.3125, 0.5625, 0.75, 0.3125, 0.25, 0.625, 0.375, 0.4375, 0.3125, 0.625, 0.625, 0.375, 0.6875, 0.625, 0.375, 0.5, 0.3125, 0.75, 0.875, 0.5625, 0.6875, 0.75, 0.75, 0.5, 0.625, 0.4375, 0.75, 0.6875, 0.6875, 0.75, 0.8125, 0.4375, 0.875, 0.4375, 0.875, 0.8125, 0.75, 0.75, 0.625, 0.625, 0.75, 0.8125, 0.6875, 0.9375, 0.875, 0.875, 0.875, 0.8125, 0.75, 0.5625, 0.8125, 0.9375, 0.8125, 0.875, 0.875, 0.8125, 0.9375, 0.875, 0.9375, 0.9375, 0.875, 1.0]}
accuracy : 97.02%