Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 30, 30, 32)        896       
_________________________________________________________________
activation_1 (Activation)    (None, 30, 30, 32)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 15, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 13, 13, 32)        9248      
_________________________________________________________________
activation_2 (Activation)    (None, 13, 13, 32)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 64)          18496     
_________________________________________________________________
activation_3 (Activation)    (None, 4, 4, 64)          0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               32896     
_________________________________________________________________
activation_4 (Activation)    (None, 128)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 36)                4644      
_________________________________________________________________
activation_5 (Activation)    (None, 36)                0         
=================================================================
Total params: 66,180
Trainable params: 66,180
Non-trainable params: 0
_________________________________________________________________
{'val_loss': [3.2578718662261963, 3.168400764465332, 3.03416109085083, 3.087543249130249, 2.709897041320801, 2.8531205654144287, 2.786649703979492, 2.8868019580841064, 2.6739559173583984, 2.7678534984588623, 2.796473264694214, 2.658784866333008, 2.734921932220459, 2.644623041152954, 2.612748384475708, 2.713624954223633, 2.60675311088562, 2.696455955505371, 2.567662477493286, 2.678790807723999, 2.603755235671997, 2.579848527908325, 2.5109386444091797, 2.5058090686798096, 2.465020179748535, 2.406219005584717, 2.49834942817688, 2.6229212284088135, 2.5162625312805176, 2.477285623550415, 2.3202860355377197, 2.3670008182525635, 2.287931442260742, 2.2267603874206543, 2.1510562896728516, 2.50492262840271, 2.2419204711914062, 1.981776475906372, 2.064840078353882, 1.8890248537063599, 2.07871675491333, 1.8638256788253784, 2.2976160049438477, 1.7788031101226807, 1.6035890579223633, 1.5526224374771118, 1.4750672578811646, 2.4338672161102295, 1.9381186962127686, 1.5691149234771729, 1.5780420303344727, 1.3993000984191895, 1.4561498165130615, 1.2090715169906616, 1.1675560474395752, 1.3041837215423584, 1.1003906726837158, 1.3449429273605347, 1.074480652809143, 1.0999109745025635, 1.407189130783081, 1.099020004272461, 1.2212164402008057, 0.8573079109191895, 1.1868547201156616, 1.426734209060669, 1.114548921585083, 0.8571280241012573, 0.7480003833770752, 0.7271414399147034, 0.7030224800109863, 0.8058131337165833, 0.5680338144302368, 0.7093848586082458, 0.5466006994247437, 0.7306263446807861, 0.7920584678649902, 1.1423051357269287, 0.8593658208847046, 0.5457120537757874, 0.5257061123847961, 0.4367220401763916, 0.4349334239959717, 0.525429368019104, 0.43108606338500977, 0.5717173218727112, 0.4696884751319885, 0.4451846182346344, 0.5875744819641113, 0.4093821048736572], 'loss': [3.6092886924743652, 3.425189733505249, 3.3777294158935547, 3.228985548019409, 3.0937039852142334, 3.0755233764648438, 2.9605050086975098, 3.037503480911255, 2.9485297203063965, 2.7943685054779053, 2.9381046295166016, 2.9757843017578125, 2.9538323879241943, 2.9119009971618652, 2.648573160171509, 2.9576239585876465, 2.894260883331299, 2.963914394378662, 2.824355363845825, 2.921356439590454, 2.831799268722534, 2.7816057205200195, 2.6874582767486572, 2.670689821243286, 2.6762428283691406, 2.5475804805755615, 2.5573909282684326, 2.7613413333892822, 2.651826858520508, 2.8006513118743896, 2.634852170944214, 2.60272479057312, 2.638953924179077, 2.505124568939209, 2.4001364707946777, 2.5193769931793213, 2.692145586013794, 2.4613840579986572, 2.5575265884399414, 2.265542984008789, 2.3675293922424316, 2.394500732421875, 2.3725242614746094, 2.338404655456543, 2.1723811626434326, 2.049720048904419, 1.8243776559829712, 2.020362377166748, 2.9852561950683594, 2.011275291442871, 1.9538224935531616, 2.023064136505127, 1.9681777954101562, 1.855722188949585, 1.7270886898040771, 1.694849967956543, 1.7815784215927124, 2.004462718963623, 1.784659743309021, 1.8010066747665405, 1.7011959552764893, 1.9816535711288452, 1.8733429908752441, 1.684983730316162, 1.4581016302108765, 1.918825387954712, 2.372767925262451, 1.59333336353302, 1.4257806539535522, 1.1070201396942139, 1.1491068601608276, 1.5943936109542847, 1.2735804319381714, 1.4055545330047607, 1.2443628311157227, 1.217227816581726, 1.4445596933364868, 2.07810115814209, 1.78043794631958, 1.1525415182113647, 1.162480115890503, 1.0526217222213745, 1.0460318326950073, 1.1245590448379517, 1.0754152536392212, 1.141763687133789, 0.9069416522979736, 1.0361047983169556, 1.2252520322799683, 1.0672123432159424], 'acc': [0.03030303120613098, 0.09090909361839294, 0.1515151560306549, 0.06060606241226196, 0.09090909361839294, 0.03030303120613098, 0.06060606241226196, 0.12121212482452393, 0.09090909361839294, 0.09090909361839294, 0.09090909361839294, 0.12121212482452393, 0.03030303120613098, 0.03030303120613098, 0.12121212482452393, 0.09090909361839294, 0.09090909361839294, 0.06060606241226196, 0.12121212482452393, 0.06060606241226196, 0.06060606241226196, 0.12121212482452393, 0.1515151560306549, 0.09090909361839294, 0.09090909361839294, 0.09090909361839294, 0.1818181872367859, 0.12121212482452393, 0.12121212482452393, 0.06060606241226196, 0.21212121844291687, 0.1515151560306549, 0.09090909361839294, 0.1515151560306549, 0.3030303120613098, 0.1515151560306549, 0.09090909361839294, 0.3636363744735718, 0.1515151560306549, 0.21212121844291687, 0.21212121844291687, 0.24242424964904785, 0.21212121844291687, 0.1515151560306549, 0.39393940567970276, 0.27272728085517883, 0.39393940567970276, 0.39393940567970276, 0.1515151560306549, 0.39393940567970276, 0.3636363744735718, 0.27272728085517883, 0.3636363744735718, 0.4848484992980957, 0.4545454680919647, 0.39393940567970276, 0.4545454680919647, 0.3333333432674408, 0.4848484992980957, 0.42424243688583374, 0.3636363744735718, 0.3636363744735718, 0.3636363744735718, 0.4545454680919647, 0.4545454680919647, 0.42424243688583374, 0.27272728085517883, 0.4848484992980957, 0.6060606241226196, 0.6363636255264282, 0.6363636255264282, 0.4848484992980957, 0.5757575631141663, 0.5757575631141663, 0.5757575631141663, 0.5454545617103577, 0.4545454680919647, 0.3333333432674408, 0.3333333432674408, 0.6363636255264282, 0.6666666865348816, 0.6666666865348816, 0.6666666865348816, 0.6363636255264282, 0.6363636255264282, 0.5757575631141663, 0.7272727489471436, 0.6060606241226196, 0.6666666865348816, 0.5454545617103577], 'val_acc': [0.0882352963089943, 0.0882352963089943, 0.05882352963089943, 0.05882352963089943, 0.0882352963089943, 0.05882352963089943, 0.0882352963089943, 0.05882352963089943, 0.0882352963089943, 0.0882352963089943, 0.0882352963089943, 0.0882352963089943, 0.0882352963089943, 0.0882352963089943, 0.0882352963089943, 0.11764705926179886, 0.1764705926179886, 0.14705882966518402, 0.1764705926179886, 0.0882352963089943, 0.20588235557079315, 0.11764705926179886, 0.11764705926179886, 0.23529411852359772, 0.4117647111415863, 0.23529411852359772, 0.0882352963089943, 0.05882352963089943, 0.0882352963089943, 0.5, 0.3529411852359772, 0.3529411852359772, 0.29411765933036804, 0.29411765933036804, 0.3529411852359772, 0.11764705926179886, 0.38235294818878174, 0.4117647111415863, 0.5882353186607361, 0.47058823704719543, 0.44117647409439087, 0.3529411852359772, 0.11764705926179886, 0.47058823704719543, 0.7058823704719543, 0.6176470518112183, 0.5588235259056091, 0.29411765933036804, 0.4117647111415863, 0.5882353186607361, 0.6176470518112183, 0.6764705777168274, 0.5882353186607361, 0.7058823704719543, 0.7941176295280457, 0.7352941036224365, 0.7352941036224365, 0.6470588445663452, 0.7352941036224365, 0.6176470518112183, 0.7352941036224365, 0.7941176295280457, 0.7352941036224365, 0.8823529481887817, 0.5588235259056091, 0.47058823704719543, 0.7058823704719543, 0.8529411554336548, 0.8529411554336548, 0.8529411554336548, 0.8529411554336548, 0.7941176295280457, 0.8529411554336548, 0.8235294222831726, 0.8529411554336548, 0.6764705777168274, 0.7058823704719543, 0.6470588445663452, 0.7941176295280457, 0.9117646813392639, 0.9117646813392639, 0.9117646813392639, 0.9411764740943909, 0.8823529481887817, 0.9117646813392639, 0.7647058963775635, 0.9411764740943909, 0.9117646813392639, 0.7941176295280457, 0.8823529481887817]}
  accuracy: 94.11%