Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 30, 30, 32)        896       
_________________________________________________________________
activation_1 (Activation)    (None, 30, 30, 32)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 15, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 13, 13, 32)        9248      
_________________________________________________________________
activation_2 (Activation)    (None, 13, 13, 32)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 64)          18496     
_________________________________________________________________
activation_3 (Activation)    (None, 4, 4, 64)          0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               32896     
_________________________________________________________________
activation_4 (Activation)    (None, 128)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 36)                4644      
_________________________________________________________________
activation_5 (Activation)    (None, 36)                0         
=================================================================
Total params: 66,180
Trainable params: 66,180
Non-trainable params: 0
_________________________________________________________________
{'val_loss': [3.571433422300551, 3.5688460614946154, 3.5762922869788274, 3.5702610386742486, 3.5700273513793945, 3.5666953298780655, 3.566130918926663, 3.562058189180162, 3.5569653034210207, 3.556609058380127, 3.548272811041938, 3.5502967410617403, 3.5411450333065457, 3.545634995566474, 3.543127335442437, 3.5344909720950657, 3.532229534784953, 3.5275292078653973, 3.5244591501024036, 3.5167609214782716, 3.5087836265563963, 3.506826082865397, 3.5055435392591687, 3.50783199734158, 3.49379440413581, 3.4803887208302817, 3.479314004050361, 3.4770700560675727, 3.469521019193861, 3.4511930571662055, 3.4427426868014868, 3.4147525999281143, 3.422171476152208, 3.3886761400434704, 3.370548391342163, 3.3657925446828205, 3.358898072772556, 3.345021438598633, 3.323188755247328, 3.276284996668498, 3.257000218497382, 3.2357117335001626, 3.1799028555552167, 3.1812394142150877, 3.1370580832163495, 3.1370206197102863, 3.0622287697262234, 3.043047454622057, 2.95847298834059, 2.9358795007069904, 2.923989666832818, 2.9029154088762072, 2.8450898541344536, 2.8222979916466606, 2.7603321022457545, 2.7571017424265545, 2.6721371279822455, 2.6259701357947454, 2.5723009586334227, 2.5912502235836454, 2.461467668745253, 2.4452323436737062, 2.480846383836534, 2.3502698209550648, 2.298636955685086, 2.237521203358968, 2.206711181004842, 2.2946071147918703, 2.091780185699463, 2.152737940682305, 2.039282359017266, 2.204225534862942, 2.0031340334150527, 1.8330574671427409, 1.872391504711575, 1.7361781517664592, 1.694132963816325, 1.6999788840611776, 1.6848480701446533, 1.608766531944275, 1.5599808586968316, 1.5290334992938572, 1.7361365530225965, 1.5068365891774496, 1.3995164765252008, 1.3935892528957792, 1.4105166832605998, 1.3654692543877496, 1.25437523788876, 1.2711960554122925, 1.516574944390191, 1.1967971457375421, 1.1527994950612386, 1.1293545405069987, 1.120345664024353, 1.1431853002972072, 1.0728323618570963, 1.4310020420286391, 1.022717010974884, 0.93281053437127, 0.8647154291470845, 0.9177914301554362, 0.9001832683881124, 1.0669904245270623, 0.9066254046228197, 0.8883624143070645, 0.776626193523407, 0.8434496137830946, 0.8053969369994269, 0.7379213823212518, 0.6923175930976868, 0.7130671117040847, 0.7076289587550693, 0.6520554608768887, 0.6609694030549791, 0.6099007990625169, 0.5879208909140693, 0.7985876268810697, 0.5154513955116272, 0.5830905543433296], 'val_acc': [0.03333333424395985, 0.03333333424395985, 0.033333333912822935, 0.03333333349890179, 0.011111111525032255, 0.04444444543785519, 0.05555555505885018, 0.02222222238779068, 0.011111111525032255, 0.033333332008785674, 0.03333333424395985, 0.03333333424395985, 0.033333333912822935, 0.03333333424395985, 0.04444444543785519, 0.04444444543785519, 0.04444444543785519, 0.0555555565489663, 0.03333333349890179, 0.03333333424395985, 0.05555555505885018, 0.08888889104127884, 0.033333333912822935, 0.0666666684879197, 0.05555555505885018, 0.04444444469279713, 0.06666666550768746, 0.03333333424395985, 0.08888888855775197, 0.033333332008785674, 0.12222222652700213, 0.12222222420904372, 0.15555555787351397, 0.1444444457689921, 0.18888889451821644, 0.1777777741352717, 0.15555555853578779, 0.22222222354676988, 0.12222222652700213, 0.22222222288449606, 0.16666666666666666, 0.2666666630241606, 0.26666667858759563, 0.18888889220025804, 0.26666666203074985, 0.2000000003311369, 0.2666666660043928, 0.21111112104521856, 0.3333333333333333, 0.27777778506278994, 0.29999999668863087, 0.25555556019147235, 0.38888888623979356, 0.31111110779974194, 0.33333333796925013, 0.3666666607062022, 0.4333333406183455, 0.38888888160387675, 0.4333333326710595, 0.41111111972067094, 0.4777777744664086, 0.533333322736952, 0.3444444477558136, 0.5444444510671828, 0.5777777771155039, 0.46666667262713113, 0.499999992052714, 0.4222222215599484, 0.5222222129503886, 0.5222222381167941, 0.4888888981607225, 0.41111111177338494, 0.5333333320087856, 0.6444444537162781, 0.6666666666666666, 0.6555555476082696, 0.6555555727746751, 0.611111130979326, 0.6555555727746751, 0.6555555568801033, 0.6333333094914754, 0.6666666666666666, 0.6222222155994839, 0.76666665342119, 0.7555555595291985, 0.7777777883741591, 0.7555555688010321, 0.7777777976459928, 0.7888889167043898, 0.7444444404708015, 0.6111111217074924, 0.7777777976459928, 0.7777777724795871, 0.7666666785875956, 0.7777777976459928, 0.8333333240614997, 0.7777777976459928, 0.6222222248713175, 0.8333333333333334, 0.8444444431198967, 0.8888888941870795, 0.8555555370118882, 0.9444444391462538, 0.7777777976459928, 0.8333333333333334, 0.8333333333333334, 0.8222222050031026, 0.8555555370118882, 0.8777777844005161, 0.8777777751286825, 0.9333333452542623, 0.8777777751286825, 0.8555555370118882, 0.899999988079071, 0.8777777751286825, 0.9111111071374681, 0.9222222261958652, 0.8222222142749362, 0.9666666679912144, 0.9111111071374681], 'loss': [3.6096983432769774, 3.611796278423733, 3.587305784225464, 3.598687426249186, 3.591252358754476, 3.5957104682922365, 3.5783976607852512, 3.589654239018758, 3.5697729322645397, 3.5663857407040065, 3.5886893219417995, 3.5730559137132434, 3.551776472727458, 3.5779855887095136, 3.570474052429199, 3.541952673594157, 3.5590528276231552, 3.551002173953586, 3.5659333176083035, 3.569390344619751, 3.5361136224534775, 3.5616747697194415, 3.550380897521973, 3.562209219402737, 3.5624136871761745, 3.5148036321004232, 3.547939109802246, 3.5314992798699274, 3.5004986180199515, 3.532684596379598, 3.488314331902398, 3.476250425974528, 3.510278171963162, 3.5097816520267062, 3.4619960255093045, 3.477297894159953, 3.4976829475826685, 3.471216419008043, 3.4307719071706138, 3.4137963824801973, 3.4027996751997205, 3.4823933548397488, 3.378385337193807, 3.343779118855794, 3.334590784708659, 3.2950961854722767, 3.3382627275254992, 3.3467231644524467, 3.182282405429416, 3.180832354227702, 3.2595211770799426, 3.172933472527398, 3.2627520084381105, 3.0867228666941324, 3.2059376928541394, 3.0467687871721054, 3.0874210357666017, 3.018674972322252, 2.910440847608778, 3.0768173111809625, 2.9082880602942573, 2.949420377943251, 3.0590209590064155, 2.9605277485317654, 2.7123112519582113, 2.834498564402262, 2.7266024430592855, 2.8889807012346056, 2.7527813328637016, 2.660286733839247, 2.637828180525038, 2.592506816652086, 3.0645245287153458, 2.5366886297861737, 2.5590227868821884, 2.349967341952854, 2.401977692710029, 2.3199791696336534, 2.322285074657864, 2.3505854023827446, 2.4494406753116182, 2.3165693283081055, 2.525148253970676, 2.559068865246243, 2.2977783415052624, 2.242634423573812, 2.4047112358940974, 2.2165374120076495, 2.0720097700754803, 2.095678891075982, 2.2003888289133706, 2.2960037973192002, 1.929368797938029, 2.1310204108556112, 2.075951925913493, 2.136741476588779, 1.8166554662916394, 2.1042794704437258, 2.047224760055542, 1.8675634225209554, 1.6970310714509753, 1.7603705565134684, 2.0469669659932452, 1.801682710647583, 2.039681577682495, 1.7951867315504286, 1.6972556087705823, 1.7071896976894803, 1.8403365082210965, 1.8198373794555665, 1.6945671452416313, 1.7705965757369995, 1.6099676979912652, 1.600826218393114, 1.3879960298538208, 1.6574718554814656, 1.563423334227668, 1.5375823789172702, 1.5749080499013266, 1.3778244707319471], 'acc': [0.02222222305006451, 0.0, 0.01111111119389534, 0.0666666684879197, 0.02222222305006451, 0.02222222305006451, 0.04444444469279713, 0.01111111119389534, 0.02222222305006451, 0.04444444469279713, 0.03333333349890179, 0.022222222718927594, 0.033333333912822935, 0.04444444543785519, 0.03333333424395985, 0.033333333912822935, 0.02222222238779068, 0.022222222718927594, 0.01111111119389534, 0.05555555588669247, 0.06666666774286165, 0.011111111525032255, 0.05555555505885018, 0.04444444353381793, 0.03333333424395985, 0.08888888855775197, 0.011111111525032255, 0.05555555588669247, 0.04444444610012902, 0.04444444610012902, 0.033333332008785674, 0.10000000132454766, 0.04444444469279713, 0.022222222718927594, 0.08888888938559426, 0.07777778059244156, 0.07777778059244156, 0.04444444610012902, 0.07777777810891469, 0.07777777819169893, 0.06666666550768746, 0.05555555588669247, 0.10000000132454766, 0.11111111376020644, 0.12222222652700213, 0.15555555853578779, 0.08888888938559426, 0.07777777827448315, 0.06666666782564587, 0.16666666898462507, 0.09999999900658925, 0.16666666832235125, 0.08888888855775197, 0.2111111130979326, 0.08888889087571038, 0.1444444497426351, 0.16666667130258347, 0.22222222023540072, 0.23333334194289312, 0.1555555565489663, 0.13333333101537492, 0.17777778175142075, 0.122222225036886, 0.2000000003311369, 0.3000000013245477, 0.23333333863152397, 0.2888888869020674, 0.2111111177338494, 0.18888889220025804, 0.2777777867184745, 0.2888888915379842, 0.3444444351726108, 0.13333333333333333, 0.25555555555555554, 0.3111111094554265, 0.3888888988229964, 0.32222221427493625, 0.33333333796925013, 0.32222221427493625, 0.3000000013245477, 0.32222222222222224, 0.34444445702764726, 0.33333333796925013, 0.25555555952919856, 0.3000000105963813, 0.3777777718173133, 0.25555555489328174, 0.366666673289405, 0.422222230831782, 0.444444434510337, 0.3333333412806193, 0.3333333412806193, 0.3777777718173133, 0.3555555681387583, 0.43333334657880995, 0.4555555582046509, 0.4555555740992228, 0.366666673289405, 0.41111111640930176, 0.4333333326710595, 0.5888888928625319, 0.5333333320087856, 0.4000000006622738, 0.4444444391462538, 0.4111111025015513, 0.5444444417953491, 0.5222222381167941, 0.5111111190583971, 0.4222222261958652, 0.4333333373069763, 0.4444444391462538, 0.47777777910232544, 0.5111110938919915, 0.5555555356873406, 0.622222199704912, 0.5333333320087856, 0.5444444510671828, 0.5333333353201548, 0.5555555701255799, 0.555555573436949]}

Accuracy: 95.67%