Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 30, 30, 32)        896       
_________________________________________________________________
activation_1 (Activation)    (None, 30, 30, 32)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 15, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 13, 13, 32)        9248      
_________________________________________________________________
activation_2 (Activation)    (None, 13, 13, 32)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 64)          18496     
_________________________________________________________________
activation_3 (Activation)    (None, 4, 4, 64)          0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               32896     
_________________________________________________________________
activation_4 (Activation)    (None, 128)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 11)                1419      
_________________________________________________________________
activation_5 (Activation)    (None, 11)                0         
=================================================================
Total params: 62,955
Trainable params: 62,955
Non-trainable params: 0
_________________________________________________________________
{'loss': [2.412925958633423, 2.388298749923706, 2.448624849319458, 2.4667465686798096, 2.3965864181518555, 2.422211170196533, 2.3975977897644043, 2.4042129516601562,
 2.4002509117126465, 2.392554759979248, 2.3904385566711426, 2.3760406970977783, 2.3839313983917236, 2.3920745849609375, 2.3713889122009277, 2.3864786624908447, 2.380230665206909, 2.3752920627593994, 2.375084638595581, 2.396160364151001, 
 2.3838486671447754, 2.3448679447174072, 2.3106095790863037, 2.336986780166626, 2.3547351360321045, 2.3304758071899414, 2.283803939819336, 2.323606491088867, 2.3111255168914795, 2.294553279876709, 2.2769434452056885, 2.2285869121551514, 2.2920339107513428, 2.269541025161743, 
 2.376697301864624, 2.184671401977539, 2.2011375427246094, 2.3629331588745117, 2.2062129974365234, 2.1632437705993652, 2.155325174331665, 2.1398720741271973, 2.1523947715759277, 2.166945219039917, 2.313425064086914, 2.1036341190338135, 1.9450218677520752, 2.1250858306884766, 1.9800426959991455, 1.9346081018447876, 1.9998213052749634, 2.2624552249908447, 
 2.1420557498931885, 2.015753984451294, 2.0204474925994873, 1.8227097988128662, 1.9304208755493164, 1.8500932455062866, 1.8584506511688232, 1.7550010681152344,
 1.862480640411377, 2.0074968338012695, 1.8644635677337646, 1.7888988256454468, 1.7086505889892578, 1.680100440979004, 1.7071651220321655, 1.5634567737579346, 1.5702195167541504, 1.6844615936279297, 1.7202736139297485, 1.8156580924987793, 1.5823116302490234, 1.3752093315124512, 1.3871489763259888, 1.5040366649627686, 1.509607195854187, 1.7510387897491455, 
 1.4615252017974854, 2.3299472332000732, 1.5500757694244385, 1.3100860118865967, 1.6671421527862549, 1.5571491718292236, 1.623683214187622, 1.296890377998352, 1.324262022972107, 1.857674241065979, 1.4300726652145386, 1.1943610906600952, 1.5781272649765015, 1.3489983081817627, 1.52349853515625, 1.214578628540039, 1.254253625869751, 1.4501398801803589,
 1.3985495567321777, 1.4027143716812134, 1.251462697982788, 1.4395976066589355, 1.0992170572280884, 1.0925458669662476, 1.1658915281295776, 1.0461876392364502, 1.1773285865783691, 1.3741625547409058, 1.0440497398376465, 1.4460614919662476, 1.3852252960205078, 1.1483674049377441], 'val_loss': [2.3895528316497803, 2.400899887084961, 2.383500576019287, 
 2.383549451828003, 2.3774545192718506, 2.378931760787964, 2.3812999725341797, 2.3711953163146973, 2.367823839187622, 2.372968912124634, 2.3729193210601807, 2.364877223968506, 2.367281675338745, 2.357748031616211, 2.3601295948028564, 2.347339153289795, 2.337327718734741, 2.332493305206299, 2.340301036834717, 2.309192419052124, 2.324004888534546, 2.315596580505371, 
 2.31280517578125, 2.282547950744629, 2.268740653991699, 2.2547407150268555, 2.247488021850586, 2.2530672550201416, 2.235074758529663, 2.2279744148254395, 2.1826601028442383, 2.170722484588623, 2.162637233734131, 2.1441972255706787, 2.159203052520752, 2.1055383682250977, 2.1428720951080322, 2.065288543701172, 2.054267406463623, 1.9919205904006958, 2.005342960357666, 
 2.027761220932007, 1.909853458404541, 2.2067580223083496, 1.9548084735870361, 1.8948644399642944, 1.8192262649536133, 1.7985821962356567, 1.7481226921081543, 1.6799986362457275, 1.7596087455749512, 1.8639624118804932, 1.7922825813293457, 1.7185571193695068, 1.601506233215332, 1.5681965351104736, 1.5906922817230225, 1.5701857805252075, 1.5069037675857544, 1.505172610282898, 
 1.4831628799438477, 1.6779694557189941, 1.4828540086746216, 1.3880254030227661, 1.4582806825637817, 1.3465596437454224, 1.3311655521392822, 1.2882933616638184, 1.2948020696640015, 1.3382786512374878, 1.3635059595108032, 1.2565635442733765, 1.2171118259429932, 1.084614634513855, 1.090809941291809, 1.084040641784668, 1.0803663730621338, 1.229295015335083, 1.3601138591766357, 1.1159125566482544, 
 1.0645629167556763, 0.9541630744934082, 1.0277262926101685, 0.9276900291442871, 0.9061577320098877, 0.8952323198318481, 0.8481239080429077, 0.9343088865280151, 0.8729234337806702, 0.9604728817939758, 0.9334608912467957, 0.901520311832428, 0.8420058488845825, 0.9332267642021179, 0.7292075157165527, 0.8042807579040527, 0.6949697732925415, 0.7861688137054443, 0.759521484375, 0.6915506720542908, 0.6489297747612, 0.6054869294166565, 0.6898921728134155, 0.584919810295105, 0.6334055662155151, 0.5398542881011963, 0.6816699504852295, 0.7955310344696045, 0.5350334644317627, 0.5928796529769897], 'val_acc': [0.1034482792019844, 0.06896551698446274, 0.1034482792019844, 0.1034482792019844, 0.13793103396892548, 0.17241379618644714, 0.1034482792019844, 0.17241379618644714, 0.13793103396892548, 0.06896551698446274, 0.06896551698446274, 0.1034482792019844, 0.06896551698446274, 0.13793103396892548, 0.06896551698446274, 0.1034482792019844, 0.2068965584039688, 0.13793103396892548, 0.1034482792019844, 0.13793103396892548, 0.06896551698446274, 0.17241379618644714, 0.17241379618644714, 0.4482758641242981, 0.3448275923728943, 0.27586206793785095, 0.13793103396892548, 0.27586206793785095, 0.27586206793785095, 0.3448275923728943, 0.4482758641242981, 0.37931033968925476, 0.3448275923728943, 0.517241358757019, 0.27586206793785095, 0.517241358757019, 0.2068965584039688, 0.4137931168079376, 0.4482758641242981, 0.6206896305084229, 0.4137931168079376, 0.24137930572032928, 0.7241379022598267, 0.13793103396892548, 0.517241358757019, 0.37931033968925476, 0.517241358757019, 0.517241358757019, 0.6551724076271057, 0.6551724076271057, 0.517241358757019, 0.27586206793785095, 0.517241358757019, 0.4137931168079376, 0.6551724076271057, 0.6206896305084229, 0.6206896305084229, 0.6206896305084229, 0.6206896305084229, 0.7586206793785095, 0.6896551847457886, 0.517241358757019, 0.7931034564971924, 0.7586206793785095, 0.517241358757019, 0.7241379022598267, 0.7241379022598267, 0.7241379022598267, 0.7241379022598267, 0.5862069129943848, 0.7241379022598267, 0.6551724076271057, 0.7586206793785095, 0.8275862336158752, 0.7241379022598267, 0.7586206793785095, 0.7586206793785095, 0.5517241358757019, 0.5862069129943848, 0.7586206793785095, 0.7241379022598267, 0.8275862336158752, 0.6896551847457886, 0.931034505367279, 0.8275862336158752, 0.7586206793785095, 0.8620689511299133, 0.7586206793785095, 0.8275862336158752, 0.6896551847457886, 0.8275862336158752, 0.7241379022598267, 0.8275862336158752, 0.6896551847457886, 0.8965517282485962, 0.7586206793785095, 0.7931034564971924, 0.8275862336158752, 0.8965517282485962, 0.7586206793785095, 0.931034505367279, 0.9655172228813171, 0.8620689511299133, 0.8965517282485962, 0.8275862336158752, 0.8965517282485962, 0.8620689511299133, 0.7931034564971924, 0.8620689511299133, 0.8620689511299133], 'acc': [0.12121212482452393, 0.27272728085517883, 0.12121212482452393, 0.06060606241226196, 0.1818181872367859, 0.06060606241226196, 0.12121212482452393, 0.24242424964904785, 0.09090909361839294, 0.09090909361839294, 0.03030303120613098, 0.09090909361839294, 0.06060606241226196, 0.09090909361839294, 0.12121212482452393, 0.1515151560306549, 0.1818181872367859, 0.12121212482452393, 0.06060606241226196, 0.06060606241226196, 0.12121212482452393, 0.12121212482452393, 0.24242424964904785, 0.12121212482452393, 0.12121212482452393, 0.1818181872367859, 0.1818181872367859, 0.09090909361839294, 0.1515151560306549, 0.1515151560306549, 0.24242424964904785, 0.21212121844291687, 0.21212121844291687, 0.1818181872367859, 0.12121212482452393, 0.3030303120613098, 0.3030303120613098, 0.12121212482452393, 0.27272728085517883, 0.3030303120613098, 0.24242424964904785, 0.24242424964904785, 0.3030303120613098, 0.1818181872367859, 0.21212121844291687, 0.27272728085517883, 0.27272728085517883, 0.3030303120613098, 0.3333333432674408, 0.4545454680919647, 0.3333333432674408, 0.27272728085517883, 0.24242424964904785, 0.3636363744735718, 0.24242424964904785, 0.4545454680919647, 0.39393940567970276, 0.3636363744735718, 0.3030303120613098, 0.42424243688583374, 0.3333333432674408, 0.27272728085517883, 0.3030303120613098, 0.3636363744735718, 0.42424243688583374, 0.4848484992980957, 0.42424243688583374, 0.5757575631141663, 0.5454545617103577, 0.5151515007019043, 0.5151515007019043, 0.3636363744735718, 0.5151515007019043, 0.6060606241226196, 0.5151515007019043, 0.5757575631141663, 0.4848484992980957, 0.39393940567970276, 0.5454545617103577, 0.1515151560306549, 0.3636363744735718, 0.6363636255264282, 0.3636363744735718, 0.3636363744735718, 0.39393940567970276, 0.5151515007019043, 0.5757575631141663, 0.39393940567970276, 0.4545454680919647, 0.5757575631141663, 0.39393940567970276, 0.5151515007019043, 0.42424243688583374, 0.6666666865348816, 0.6060606241226196, 0.5454545617103577, 0.42424243688583374, 0.5454545617103577, 0.6060606241226196, 0.5454545617103577, 0.7272727489471436, 0.6060606241226196, 
0.6060606241226196, 0.6060606241226196, 0.5454545617103577, 0.5151515007019043, 0.6363636255264282, 0.5454545617103577, 0.4545454680919647, 0.6666666865348816]}

accuracy: 96.55%